In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [10]:
df = {
    "id" : [1,2,3,4,5,6],
    "car": ["A",np.nan,"C",np.nan,"E","F"],
    "color":["red",np.nan,"Blue",np.nan,"white","pink"]
}
df = pd.DataFrame(df,columns = ["id","car","color"])
df.head()

   id  car  color
0   1    A    red
1   2  NaN    NaN
2   3    C   Blue
3   4  NaN    NaN
4   5    E  white

In [18]:
df.dropna(inplace = True)
df

   id car  color
0   1   A    red
2   3   C   Blue
4   5   E  white
5   6   F   pink

In [19]:
df.dropna(axis=1)

   id car  color
0   1   A    red
2   3   C   Blue
4   5   E  white
5   6   F   pink

In [20]:
df.dropna(how="all")

   id car  color
0   1   A    red
2   3   C   Blue
4   5   E  white
5   6   F   pink